html/material/gradle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gradle入门</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">Gradle入门</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8484998">环境</a></li>
<li><a href="#orgedfe235">hello world</a></li>
<li><a href="#orga7a128d">执行流程</a></li>
<li><a href="#org20abef9">配置语法</a>
<ul>
<li><a href="#orgdab4fee">闭包</a></li>
<li><a href="#orgb540096">Getter 和 Setter</a></li>
<li><a href="#org8eacc5d">Project, Task, Action</a>
<ul>
<li><a href="#org4a176fd">自定义Task</a></li>
<li><a href="#org060a4ed">Task的依赖关系</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc31e962">GradleWrapper</a>
<ul>
<li><a href="#orgf04d98a">生成wrapper</a></li>
<li><a href="#org559e851">gradle-wrapper.properties配置文件</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Gradle在语法上是基于Groovy语言的，在项目管理上是基于Ant和Maven概念的项目自动化建构工具
</p>

<pre class="example">
Groovy 是一种基于JVM的敏捷开发语言

可以简单的理解为强类型语言java的弱类型版本
</pre>


<div id="outline-container-org8484998" class="outline-2">
<h2 id="org8484998">环境</h2>
<div class="outline-text-2" id="text-org8484998">
<ol class="org-ol">
<li>Gradle 运行依赖JVM，也就是java运行的环境。所以要安装jdk和jre</li>
<li>到Gradle官网现在Gradle的压缩包</li>
<li>下载压缩包后，解压，然后配置环境变量</li>
</ol>

<p>
MacOS 下配置。在 <span class="underline">~/.bash_profile</span> 中添加如下代码
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">gradle  &#27880;&#24847;gradle-2.14.1&#26159;&#33258;&#24049;&#35299;&#21387;&#30340;&#36335;&#24452;</span>
<span style="color: #f08080;">export</span> <span style="color: #4eee94;">GRADLE_HOME</span>=${<span style="color: #4eee94;">HOME</span>}/gradle-2.14.1
<span style="color: #4eee94;">PATH</span>=${<span style="color: #4eee94;">PATH</span>}:${<span style="color: #4eee94;">GRADLE_HOME</span>}/bin
<span style="color: #f08080;">export</span> PATH
</pre>
</div>

<p>
命令行输入 <span class="underline">gradle -v</span> 查看是否安装成功
</p>

<div class="org-src-container">
<pre class="src src-sh">$ gradle -v

------------------------------------------------------------
Gradle 2.14.1
------------------------------------------------------------

Build time:   2016-07-18 06:38:37 UTC
Revision:     d9e2113d9fb05a5caabba61798bdb8dfdca83719

Groovy:       2.4.4
Ant:          Apache Ant(TM) version 1.9.6 compiled on June 29 2015
JVM:          1.8.0_111 (Oracle Corporation 25.111-b14)
OS:           Mac OS X 10.12.2 x86_64
</pre>
</div>
</div>
</div>

<div id="outline-container-orgedfe235" class="outline-2">
<h2 id="orgedfe235">hello world</h2>
<div class="outline-text-2" id="text-orgedfe235">
<p>
创建一个 <span class="underline">test_gralde</span> 文件夹。然后在文件夹里面创建一个 <span class="underline">build.gradle</span> 文件。在build.gradle中添加如下代码：
</p>

<div class="org-src-container">
<pre class="src src-sh">task helloworld{
    doLast{
        println<span style="color: #deb887;">'Hello World!'</span>
    }
}
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#21518;&#32773;&#31561;&#21516;&#20110;&#19979;&#38754;&#30340;&#20195;&#30721;,</span>
task helloworld2 &lt;&lt;{
    println <span style="color: #deb887;">"Hello World!"</span>
}
</pre>
</div>

<ul class="org-ul">
<li>这个构建脚本定义一个 <b>任务</b> <span class="underline">Task</span> ，任务名字叫 <span class="underline">helloworld</span></li>
<li>任务helloworld添加了一个 <b>动作</b> <span class="underline">Action</span> 
<ul class="org-ul">
<li>这是一段Groovy语言实现的闭包， <span class="underline">doLast</span> 就意味着在 <span class="underline">Task执行完毕之后</span> 要 <b>回调doLast的这部分闭包</b> 的代码实现</li>
<li>第二个方法中的 <span class="underline">&lt;&lt;</span> 表示向 <b>helloworld中加入执行代码</b></li>
</ul></li>
<li>语法部分，基本是Groovy语法，加上一些DSL的约定</li>
</ul>

<pre class="example">
  文件名不要乱起，因为执行gradle命令的时候，会默认加当前目录下的build.gradle脚本文件

  当然可以通过 -b 参数指定想要加载执行的文件
</pre>
</div>
</div>

<div id="outline-container-orga7a128d" class="outline-2">
<h2 id="orga7a128d">执行流程</h2>
<div class="outline-text-2" id="text-orga7a128d">
<p>
Gradle是一种 <b>声明式</b> 的 <span class="underline">构建工具</span> 。在执行时，Gradle并不会一开始便顺序执行build.gradle文件中的内容，而是分为两个阶段：
</p>
<ol class="org-ol">
<li>第一个阶段是配置阶段：Gradle将读取所有build.gradle文件的所有内容来配置Project和Task等，比如
<ul class="org-ul">
<li>设置Project和Task的Property</li>
<li>处理Task之间的依赖关系</li>
<li>&#x2026;&#x2026;</li>
</ul></li>
<li>第二个阶段才是实际的执行阶段</li>
</ol>


<pre class="example">
和Maven一样，Gradle只是提供了构建项目的一个框架，真正起作用的是Plugin

Gradle在默认情况下提供了许多常用的Plugin，其中包括有构建Java项目的Plugin，还有Android等

与Maven不同的是，Gradle不提供内建的项目生命周期管理，只是java Plugin向Project中添加了许多Task，这些Task依次执行，营造了一种如同Maven般项目构建周期
</pre>

<p>
现在来看一个基本结构的Android多Moudule（也就是gradle中的多Project Multi-Projects Build）的基本项目结构：
</p>

<div class="org-src-container">
<pre class="src src-sh">&#9500;&#9472;&#9472; app <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Android App&#30446;&#24405;</span>
&#9474;   &#9500;&#9472;&#9472; app.iml
&#9474;   &#9500;&#9472;&#9472; build <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#26500;&#24314;&#36755;&#20986;&#30446;&#24405;</span>
&#9474;   &#9500;&#9472;&#9472; build.gradle <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#26500;&#24314;&#33050;&#26412;</span>
&#9474;   &#9500;&#9472;&#9472; libs <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">so&#30456;&#20851;&#24211;</span>
&#9474;   &#9500;&#9472;&#9472; proguard-rules.pro <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">proguard&#28151;&#28102;&#37197;&#32622;</span>
&#9474;   &#9492;&#9472;&#9472; src <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#28304;&#20195;&#30721;&#65292;&#36164;&#28304;&#31561;</span>
&#9500;&#9472;&#9472; module <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">Android &#21478;&#22806;&#19968;&#20010;module&#30446;&#24405;</span>
&#9474;   &#9500;&#9472;&#9472; module.iml
&#9474;   &#9500;&#9472;&#9472; build <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#26500;&#24314;&#36755;&#20986;&#30446;&#24405;</span>
&#9474;   &#9500;&#9472;&#9472; build.gradle <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#26500;&#24314;&#33050;&#26412;</span>
&#9474;   &#9500;&#9472;&#9472; libs <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">so&#30456;&#20851;&#24211;</span>
&#9474;   &#9500;&#9472;&#9472; proguard-rules.pro <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">proguard&#28151;&#28102;&#37197;&#32622;</span>
&#9474;   &#9492;&#9472;&#9472; src <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#28304;&#20195;&#30721;&#65292;&#36164;&#28304;&#31561;</span>
&#9500;&#9472;&#9472; build
&#9474;   &#9492;&#9472;&#9472; intermediates
&#9500;&#9472;&#9472; build.gradle <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#24037;&#31243;&#26500;&#24314;&#25991;&#20214;</span>
&#9500;&#9472;&#9472; gradle
&#9474;   &#9492;&#9472;&#9472; wrapper
&#9500;&#9472;&#9472; gradle.properties <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">gradle&#30340;&#37197;&#32622;</span>
&#9500;&#9472;&#9472; gradlew <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">gradle wrapper linux shell&#33050;&#26412;</span>
&#9500;&#9472;&#9472; gradlew.bat
&#9500;&#9472;&#9472; LibSqlite.iml
&#9500;&#9472;&#9472; local.properties <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#37197;&#32622;Androod SDK&#20301;&#32622;&#25991;&#20214;</span>
&#9492;&#9472;&#9472; settings.gradle <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#24037;&#31243;&#37197;&#32622;</span>
</pre>
</div>

<p>
如果抽象成Gradle多Project的样子： 
</p>

<div class="org-src-container">
<pre class="src src-sh">&#9500;&#9472;&#9472; app 
&#9474;   &#9500;&#9472;&#9472; build.gradle <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#26500;&#24314;&#33050;&#26412;</span>
&#9500;&#9472;&#9472; module 
&#9474;   &#9500;&#9472;&#9472; build.gradle <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#26500;&#24314;&#33050;&#26412;</span>
&#9500;&#9472;&#9472; build.gradle <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#24037;&#31243;&#26500;&#24314;&#25991;&#20214;</span>
&#9500;&#9472;&#9472; gradle
&#9474;   &#9492;&#9472;&#9472; wrapper    <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#20808;&#19981;&#21435;&#31649;&#23427;</span>
&#9500;&#9472;&#9472; gradle.properties <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">gradle&#30340;&#37197;&#32622;</span>
&#9500;&#9472;&#9472; gradlew <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">gradle wrapper linux shell&#33050;&#26412;</span>
&#9500;&#9472;&#9472; gradlew.bat
&#9492;&#9472;&#9472; settings.gradle <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#24037;&#31243;&#37197;&#32622;</span>
</pre>
</div>

<ul class="org-ul">
<li>Gradle为每个项目都创建了一个 <span class="underline">build.gradle</span> 文件，Gradle提供了强大的多Project构建支持。</li>
<li>要创建多Project的Gradle项目，需要在 <span class="underline">根Project</span> 中加入名为 <span class="underline">settings.gradle</span> 的配置文件
<ul class="org-ul">
<li>该文件应该包含各个子Project的名称</li>
<li>Gradle中的Project可以简单的映射为Maven中的module</li>
</ul></li>
<li>在最外层的build.gradle。一般干得活是： <b>配置其他子Project的</b> 
<ul class="org-ul">
<li>比如：为子Project添加一些属性</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org20abef9" class="outline-2">
<h2 id="org20abef9">配置语法</h2>
<div class="outline-text-2" id="text-org20abef9">
<pre class="example">
Gradle提供了一整套DSL，所以在很多时候写的代码似乎已经脱离了groovy

但是在底层依然是执行的groovy所以很多语法还是Groovy的语法规则
</pre>

<p>
看一个androidStudio中app下的build.gradle的配置：
</p>

<div class="org-src-container">
<pre class="src src-groovy">apply plugin: 'com.android.application'

android {
    compileSdkVersion 25
    buildToolsVersion "25.0.0"
    defaultConfig {
	applicationId "me.febsky.demo"
	minSdkVersion 15
	targetSdkVersion 25
	versionCode 1
	versionName "1.0"
	testInstrumentationRunner "android.support.test.runner.AndroidJUnitRunner"
    }
    buildTypes {
	release {
	    minifyEnabled false
	    proguardFiles getDefaultProguardFile('proguard-android.txt'), 'proguard-rules.pro'
	}
    }
}

dependencies {
    compile fileTree(dir: 'libs', include: ['*.jar'])
    compile 'com.android.support:appcompat-v7:25.1.0'
}
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">apply plugin: 'com.android.application'</span> 这里的apply是一个函数，实际上调用的是 <span class="underline">apply(plugin: 'com.android.application')</span>
<ul class="org-ul">
<li><span class="underline">plugin: 'com.android.application'</span> 表示的是一个map类型，实际上应该是 <span class="underline">[plugin: 'com.android.application']</span></li>
</ul></li>
</ul>

<pre class="example">
1. 方法调用，圆括号可以省略

2. 如果方法参数是个Map，方括号可以省略
</pre>
</div>
<div id="outline-container-orgdab4fee" class="outline-3">
<h3 id="orgdab4fee">闭包</h3>
<div class="outline-text-3" id="text-orgdab4fee">
<p>
上面的dependencies实际上也是个方法调用，调用的是Project的dependcies方法，但是参数也是一个函数。所以还能写成这样： 
</p>

<div class="org-src-container">
<pre class="src src-groovy">#所以代码还能写成这样
dependencies (){
    compile fileTree(dir: 'libs', include: ['*.jar'])
    compile 'com.android.support:appcompat-v7:25.1.0'
}
</pre>
</div>

<pre class="example">
  如果闭包是方法的最后一个参数，那么闭包可以放在圆括号外面
</pre>
</div>
</div>
<div id="outline-container-orgb540096" class="outline-3">
<h3 id="orgb540096">Getter 和 Setter</h3>
<div class="outline-text-3" id="text-orgb540096">
<p>
Groovy动态的为每一个字段都会自动生成getter和setter，并且可以通过像访问字段本身一样调用getter和setter
</p>

<div class="org-src-container">
<pre class="src src-groovy">println project.version // Groovy  

println(project.getVersion()) // Groovy
</pre>
</div>
</div>
</div>
<div id="outline-container-org8eacc5d" class="outline-3">
<h3 id="org8eacc5d">Project, Task, Action</h3>
<div class="outline-text-3" id="text-org8eacc5d">
<p>
Gradle的 <span class="underline">Project之间的依赖关系</span> 是基于 <span class="underline">Task</span> 的，而不是整个Project的
</p>
<ul class="org-ul">
<li>Project: build.gradle脚本的全部作用，其实就是配置一个Project实例
<ul class="org-ul">
<li>build.gradle 中可以隐式的操纵Project实例，比如，apply插件、声明依赖、定义Task等
<ul class="org-ul">
<li>apply、dependencies、task等实际上是Project的方法，参数是一个代码块</li>
</ul></li>
<li>如果需要，也可以显示的操纵Project实例
<ul class="org-ul">
<li>比如：project.ext.myProp = 'myValue'</li>
</ul></li>
</ul></li>
<li>Task: 被组织成了一个 <span class="underline">有向无环图</span> 
<ul class="org-ul">
<li>要么是由不同的Plugin引入的，要么是自己在build.gradle文件中直接创建的</li>
<li>Gradle保证Task按照 <b>依赖顺序</b> 执行，并且每个Task <b>最多只被执行一次</b></li>
</ul></li>
</ul>

<pre class="example">
Gradle在默认情况下提供了几个常用的Task，比如查看Project的Properties、显示当前Project中定义的所有Task等

可以通过一下命令行查看Project中所有的Task：$ gradle tasks

可以看到，Gradle默认提供了dependencies、projects和properties等Task

dependencies用于显示Project的依赖信息，projects用于显示所有Project，包括根Project和子Project，而properties则用于显示一个Project所包含的所有Property
</pre>
</div>

<div id="outline-container-org4a176fd" class="outline-4">
<h4 id="org4a176fd">自定义Task</h4>
<div class="outline-text-4" id="text-org4a176fd">
<p>
可以自定义一个Task：
</p>

<div class="org-src-container">
<pre class="src src-groovy">task myTask {  
    doFirst {  
	println 'hello'  
    }  
    doLast {  
	println 'world'  
    }  
}  
</pre>
</div>

<p>
也显示声明一个Task的类型： 
</p>
<div class="org-src-container">
<pre class="src src-groovy">#2 Test文件夹下建一个src目录，建一个dst目录，src目录下建立一个文件，命名为test.txt
task copyFile(type: Copy){
    from "src"
    into "dst"
}
</pre>
</div>

<p>
也可以定义成一段脚本： 
</p>

<div class="org-src-container">
<pre class="src src-groovy">#1
task helloWorld &lt;&lt; {
    println "Hello World"
}
</pre>
</div>

<p>
如果task声明在根Project的build.gradle中的allprojects()方法中，那么这个Task会应用于所有的Project
</p>
</div>
</div>

<div id="outline-container-org060a4ed" class="outline-4">
<h4 id="org060a4ed">Task的依赖关系</h4>
<div class="outline-text-4" id="text-org060a4ed">
<div class="org-src-container">
<pre class="src src-groovy">task taskA &lt;&lt; {
   println 'this is taskA from project 1'
}

task taskB &lt;&lt; {
   println 'this is taskB from project 1'
}

taskA.dependsOn taskB
</pre>
</div>

<p>
这样如果执行taskA的话，就会先执行taskB
</p>

<pre class="example">
  如果是Muliti-Project的模式，依赖关系要带着所属的Project

  如taskA.dependsOn ':other-project:taskC' 其中taskC位于和taskA不同的Project中，other-project就是为另外一个项目的名字
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc31e962" class="outline-2">
<h2 id="orgc31e962">GradleWrapper</h2>
<div class="outline-text-2" id="text-orgc31e962">
<p>
Wrapper其实就是对Gradle的一层包装，便于在团队开发过程中 <b>统一Gradle构建的版本</b> 
</p>

<pre class="example">
  提交到git上，然后别人可以下载下来，这样大家都可以使用统一的Gradle版本进行构建，避免因为Gradle版本不统一带来的不必要的问题
</pre>
</div>

<div id="outline-container-orgf04d98a" class="outline-3">
<h3 id="orgf04d98a">生成wrapper</h3>
<div class="outline-text-3" id="text-orgf04d98a">
<p>
gradle内置了生成wrapper的task，可以命令行执行：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ gradle wrapper
</pre>
</div>

<p>
生成后的目录结构如下： 
</p>
<pre class="example">
├── gradle
│   └── wrapper
│       ├── gradle-wrapper.jar
│       └── gradle-wrapper.properties
├── gradlew
└── gradlew.bat
</pre>

<ul class="org-ul">
<li><span class="underline">gradlew</span> 和 <span class="underline">gradlew.bat</span> 分别是Linux和Window下的 <b>可执行脚本</b> ：他们的用法和gradle原生命令是一样的</li>
<li><span class="underline">gradle-wrapper.jar</span> 是 <b>具体业务逻辑实现的jar包</b> ：gradlew最终还是使用 <span class="underline">java执行</span> 的这个 <span class="underline">jar包</span> 来执行相关gradle操作。</li>
<li><span class="underline">gradle-wrapper.properties</span> 是 <b>配置文件</b> ：用于配置使用哪个版本的gradle等</li>
</ul>
</div>
</div>

<div id="outline-container-org559e851" class="outline-3">
<h3 id="org559e851">gradle-wrapper.properties配置文件</h3>
<div class="outline-text-3" id="text-org559e851">
<pre class="example">
#Sat Jan 21 14:02:40 CST 2017
distributionBase=GRADLE_USER_HOME
distributionPath=wrapper/dists
zipStoreBase=GRADLE_USER_HOME
zipStorePath=wrapper/dists
distributionUrl=https\://services.gradle.org/distributions/gradle-2.14.1-bin.zip
</pre>

<ul class="org-ul">
<li>distributionBase: 下载的gradle压缩包解压后存储的主目录</li>
<li>distributionPath: 相对于distributionBase的解压后的gradle压缩包的路径</li>
<li>zipStoreBase: 同distributionBase，只不过是存放zip压缩包的</li>
<li>zipStorePath: 同distributionPath，只不过是存放zip压缩包的</li>
<li>distributionUrl: gradle发行版压缩包的下载地址，也就是你现在这个项目将要依赖的gradle的版本</li>
</ul>

<pre class="example">
  生成wrapper时候可以通过指定参数的方式来指定gradle-wrapper.properties内容。
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
